# Browsers and tools
cask "google-chrome"
cask "chromedriver"
cask "firefox"
cask "claude"
cask "handbrake"
cask "vlc"

# Terminal
cask "iterm2"

# Development tools
brew "git"
brew "ripgrep"
brew "z"
brew "fzf"
brew "asdf"
brew "just"
brew "protobuf"
brew "tldr"
brew "docker"
brew "jq"
brew "shellcheck"
brew "httpie"
brew "neovim"
brew "bat"
brew "eza"
brew "watch"
brew "gh"
brew "stow"
brew "direnv"
brew "uv"

# Data Processing
brew "redpanda-data/tap/redpanda"

# Databases
brew "postgresql@16", restart_service: true, link: true

# Text editors
cask "zed"

# Productivity
cask "alfred"
cask "rectangle"
cask "clipy"

# Communication
cask "slack"
cask "discord"

# Media
cask "spotify"

# Utilities
cask "the-unarchiver"

# LLM tools
brew "ollama"

# Fonts
brew "font-hack-nerd-font"
brew "font-fira-mono"

# Erlang build tools
brew "autoconf"
brew "automake"
brew "libtool"
brew "wxwidgets"
brew "openssl@1.1"
