tap "redpanda-data/tap"
brew "hurl"
brew "act"
brew "asdf"
brew "autoconf"
brew "automake"
brew "bat"
brew "direnv"
brew "docker"
brew "eza"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "handbrake"
brew "htop"
brew "httpie"
brew "jq"
brew "just"
brew "lazydocker"
brew "lazygit"
brew "libtool"
brew "neovim"
brew "ollama"
brew "odinfmt"
brew "postgresql@18", restart_service: :changed, link: true
brew "ripgrep"
brew "rustup"
brew "shellcheck"
brew "stow"
brew "tldr"
brew "uv"
brew "watch"
brew "z"
cask "alfred"
cask "chromedriver"
cask "claude"
cask "clipy"
cask "discord"
cask "firefox"
cask "ghostty"
cask "google-chrome"
cask "handbrake-app"
cask "rectangle"
cask "slack"
cask "spotify"
cask "the-unarchiver"
cask "vlc"
cask "whatsapp"
cask "zed"
brew "pgcli"
brew "llm"
brew "helix"
brew "action-validator"
brew "git-delta"
brew "ast-grep"
brew "opencode"
brew "mise"
cask "codex"
brew "lsd"
brew "ampcode/tap/ampcode"
cask "cleanshot"


